0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.03734;

boundaryField
{
    inlet
    {
        type            fixedValue;
        intensity       0.05;
        value           $internalField; //$internalField
    }
    concreteWall
    {
        type            kqRWallFunction; //nutKRugFuction
        value           $internalField;
    }
    pipe1
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    pipe2
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    restante
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    ".*"
    {
        type            inletOutlet;
        inletValue		$internalField;
        value           uniform 0;
    }
};


// ************************************************************************* //
