0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 145.07;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    concreteWall
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    pipe1
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    pipe2
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    restante
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    atmosphere //".*"
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
}


// ************************************************************************* //
